neroroxxx/esp32/boards.txt
esp32s3.menu.CPUFreq.240=240MHz (WiFi)
esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
esp32s3.menu.CPUFreq.160=160MHz (WiFi)
esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
esp32s3.menu.CPUFreq.80=80MHz (WiFi)
esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
esp32s3.menu.CPUFreq.40=40MHz
esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
esp32s3.menu.CPUFreq.20=20MHz
esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
esp32s3.menu.CPUFreq.10=10MHz
esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

esp32s3.menu.UploadSpeed.921600=921600
esp32s3.menu.UploadSpeed.921600.upload.speed=921600
esp32s3.menu.UploadSpeed.115200=115200
esp32s3.menu.UploadSpeed.115200.upload.speed=115200
esp32s3.menu.UploadSpeed.256000.windows=256000
esp32s3.menu.UploadSpeed.256000.upload.speed=256000
esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32s3.menu.UploadSpeed.230400=230400
esp32s3.menu.UploadSpeed.230400.upload.speed=230400
esp32s3.menu.UploadSpeed.460800.linux=460800
esp32s3.menu.UploadSpeed.460800.macosx=460800
esp32s3.menu.UploadSpeed.460800.upload.speed=460800
esp32s3.menu.UploadSpeed.512000.windows=512000
esp32s3.menu.UploadSpeed.512000.upload.speed=512000

esp32s3.menu.DebugLevel.none=None
esp32s3.menu.DebugLevel.none.build.code_debug=0
esp32s3.menu.DebugLevel.error=Error
esp32s3.menu.DebugLevel.error.build.code_debug=1
esp32s3.menu.DebugLevel.warn=Warn
esp32s3.menu.DebugLevel.warn.build.code_debug=2
esp32s3.menu.DebugLevel.info=Info
esp32s3.menu.DebugLevel.info.build.code_debug=3
esp32s3.menu.DebugLevel.debug=Debug
esp32s3.menu.DebugLevel.debug.build.code_debug=4
esp32s3.menu.DebugLevel.verbose=Verbose
esp32s3.menu.DebugLevel.verbose.build.code_debug=5

esp32s3.menu.EraseFlash.none=Disabled
esp32s3.menu.EraseFlash.none.upload.erase_cmd=
esp32s3.menu.EraseFlash.all=Enabled
esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

esp32s3.menu.ZigbeeMode.default=Disabled
esp32s3.menu.ZigbeeMode.default.build.zigbee_mode=
esp32s3.menu.ZigbeeMode.default.build.zigbee_libs=
esp32s3.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
esp32s3.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32s3.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

##############################################################

bmc_sens3.name=BMC SENS3 (ESP32-S3)

bmc_sens3.bootloader.tool=esptool_py
bmc_sens3.bootloader.tool.default=esptool_py

bmc_sens3.upload.tool=esptool_py
bmc_sens3.upload.tool.default=esptool_py
bmc_sens3.upload.tool.network=esp_ota

bmc_sens3.upload.maximum_size=1310720
bmc_sens3.upload.maximum_data_size=327680
bmc_sens3.upload.flags=
bmc_sens3.upload.extra_flags=
bmc_sens3.upload.use_1200bps_touch=true
bmc_sens3.upload.wait_for_upload_port=true

bmc_sens3.serial.disableDTR=false
bmc_sens3.serial.disableRTS=false

bmc_sens3.build.tarch=xtensa
bmc_sens3.build.bootloader_addr=0x0
bmc_sens3.build.target=esp32s3
bmc_sens3.build.mcu=esp32s3
bmc_sens3.build.core=esp32
bmc_sens3.build.variant=esp32s3
bmc_sens3.build.board=BMC_SENS3

bmc_sens3.build.usb_mode=0
bmc_sens3.build.cdc_on_boot=1
bmc_sens3.build.msc_on_boot=0
bmc_sens3.build.dfu_on_boot=0

bmc_sens3.build.f_cpu=240000000L
bmc_sens3.build.flash_size=4MB
bmc_sens3.build.flash_freq=80m
bmc_sens3.build.flash_mode=dio
bmc_sens3.build.boot=qio
bmc_sens3.build.boot_freq=80m
bmc_sens3.build.partitions=default
bmc_sens3.build.defines=
# bmc_sens3.build.extra_flags=-DESP32 -include "{build.source.path}/config.h"
bmc_sens3.build.loop_core=
bmc_sens3.build.event_core=
bmc_sens3.build.psram_type=qspi
bmc_sens3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
bmc_sens3.menu.JTAGAdapter.default=Disabled
bmc_sens3.menu.JTAGAdapter.default.build.copy_jtag_files=0
bmc_sens3.menu.JTAGAdapter.builtin=Integrated USB JTAG
bmc_sens3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
bmc_sens3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
bmc_sens3.menu.JTAGAdapter.external=FTDI Adapter
bmc_sens3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
bmc_sens3.menu.JTAGAdapter.external.build.copy_jtag_files=1
bmc_sens3.menu.JTAGAdapter.bridge=ESP USB Bridge
bmc_sens3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
bmc_sens3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

bmc_sens3.menu.PSRAM.disabled=Disabled
bmc_sens3.menu.PSRAM.disabled.build.defines=
bmc_sens3.menu.PSRAM.disabled.build.psram_type=qspi
bmc_sens3.menu.PSRAM.enabled=QSPI PSRAM
bmc_sens3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
bmc_sens3.menu.PSRAM.enabled.build.psram_type=qspi
bmc_sens3.menu.PSRAM.opi=OPI PSRAM
bmc_sens3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
bmc_sens3.menu.PSRAM.opi.build.psram_type=opi

bmc_sens3.menu.FlashMode.qio=QIO 80MHz
bmc_sens3.menu.FlashMode.qio.build.flash_mode=dio
bmc_sens3.menu.FlashMode.qio.build.boot=qio
bmc_sens3.menu.FlashMode.qio.build.boot_freq=80m
bmc_sens3.menu.FlashMode.qio.build.flash_freq=80m
bmc_sens3.menu.FlashMode.qio120=QIO 120MHz
bmc_sens3.menu.FlashMode.qio120.build.flash_mode=dio
bmc_sens3.menu.FlashMode.qio120.build.boot=qio
bmc_sens3.menu.FlashMode.qio120.build.boot_freq=120m
bmc_sens3.menu.FlashMode.qio120.build.flash_freq=80m
bmc_sens3.menu.FlashMode.dio=DIO 80MHz
bmc_sens3.menu.FlashMode.dio.build.flash_mode=dio
bmc_sens3.menu.FlashMode.dio.build.boot=dio
bmc_sens3.menu.FlashMode.dio.build.boot_freq=80m
bmc_sens3.menu.FlashMode.dio.build.flash_freq=80m
bmc_sens3.menu.FlashMode.opi=OPI 80MHz
bmc_sens3.menu.FlashMode.opi.build.flash_mode=dout
bmc_sens3.menu.FlashMode.opi.build.boot=opi
bmc_sens3.menu.FlashMode.opi.build.boot_freq=80m
bmc_sens3.menu.FlashMode.opi.build.flash_freq=80m

bmc_sens3.menu.FlashSize.4M=4MB (32Mb)
bmc_sens3.menu.FlashSize.4M.build.flash_size=4MB
bmc_sens3.menu.FlashSize.8M=8MB (64Mb)
bmc_sens3.menu.FlashSize.8M.build.flash_size=8MB
bmc_sens3.menu.FlashSize.16M=16MB (128Mb)
bmc_sens3.menu.FlashSize.16M.build.flash_size=16MB
bmc_sens3.menu.FlashSize.32M=32MB (256Mb)
bmc_sens3.menu.FlashSize.32M.build.flash_size=32MB

