neroroxxx/esp32/boards.txt
bmc_sens3.menu.LoopCore.1=Core 1
bmc_sens3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
bmc_sens3.menu.LoopCore.0=Core 0
bmc_sens3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

bmc_sens3.menu.EventsCore.1=Core 1
bmc_sens3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
bmc_sens3.menu.EventsCore.0=Core 0
bmc_sens3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

# bmc_sens3.menu.USBMode.hwcdc=Hardware CDC and JTAG
# bmc_sens3.menu.USBMode.hwcdc.build.usb_mode=1
bmc_sens3.menu.USBMode.default=USB-OTG (TinyUSB)
bmc_sens3.menu.USBMode.default.build.usb_mode=0

# bmc_sens3.menu.CDCOnBoot.default=Disabled
# bmc_sens3.menu.CDCOnBoot.default.build.cdc_on_boot=0
bmc_sens3.menu.CDCOnBoot.cdc=Enabled
bmc_sens3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

bmc_sens3.menu.MSCOnBoot.default=Disabled
bmc_sens3.menu.MSCOnBoot.default.build.msc_on_boot=0
# bmc_sens3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
# bmc_sens3.menu.MSCOnBoot.msc.build.msc_on_boot=1

bmc_sens3.menu.DFUOnBoot.default=Disabled
bmc_sens3.menu.DFUOnBoot.default.build.dfu_on_boot=0
# bmc_sens3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
# bmc_sens3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

# bmc_sens3.menu.UploadMode.default=UART0 / Hardware CDC
# bmc_sens3.menu.UploadMode.default.upload.use_1200bps_touch=false
# bmc_sens3.menu.UploadMode.default.upload.wait_for_upload_port=false
bmc_sens3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
bmc_sens3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
bmc_sens3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

bmc_sens3.menu.PartitionScheme.huge_app=BMC APP (3MB No OTA/1MB SPIFFS)
bmc_sens3.menu.PartitionScheme.huge_app.build.partitions=huge_app
bmc_sens3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

bmc_sens3.menu.CPUFreq.240=240MHz (WiFi)
bmc_sens3.menu.CPUFreq.240.build.f_cpu=240000000L
bmc_sens3.menu.CPUFreq.160=160MHz (WiFi)
bmc_sens3.menu.CPUFreq.160.build.f_cpu=160000000L
bmc_sens3.menu.CPUFreq.80=80MHz (WiFi)
bmc_sens3.menu.CPUFreq.80.build.f_cpu=80000000L
bmc_sens3.menu.CPUFreq.40=40MHz
bmc_sens3.menu.CPUFreq.40.build.f_cpu=40000000L
bmc_sens3.menu.CPUFreq.20=20MHz
bmc_sens3.menu.CPUFreq.20.build.f_cpu=20000000L
bmc_sens3.menu.CPUFreq.10=10MHz
bmc_sens3.menu.CPUFreq.10.build.f_cpu=10000000L

bmc_sens3.menu.UploadSpeed.921600=921600
bmc_sens3.menu.UploadSpeed.921600.upload.speed=921600
bmc_sens3.menu.UploadSpeed.115200=115200
bmc_sens3.menu.UploadSpeed.115200.upload.speed=115200
bmc_sens3.menu.UploadSpeed.256000.windows=256000
bmc_sens3.menu.UploadSpeed.256000.upload.speed=256000
bmc_sens3.menu.UploadSpeed.230400.windows.upload.speed=256000
bmc_sens3.menu.UploadSpeed.230400=230400
bmc_sens3.menu.UploadSpeed.230400.upload.speed=230400
bmc_sens3.menu.UploadSpeed.460800.linux=460800
bmc_sens3.menu.UploadSpeed.460800.macosx=460800
bmc_sens3.menu.UploadSpeed.460800.upload.speed=460800
bmc_sens3.menu.UploadSpeed.512000.windows=512000
bmc_sens3.menu.UploadSpeed.512000.upload.speed=512000

bmc_sens3.menu.DebugLevel.none=None
bmc_sens3.menu.DebugLevel.none.build.code_debug=0
bmc_sens3.menu.DebugLevel.error=Error
bmc_sens3.menu.DebugLevel.error.build.code_debug=1
bmc_sens3.menu.DebugLevel.warn=Warn
bmc_sens3.menu.DebugLevel.warn.build.code_debug=2
bmc_sens3.menu.DebugLevel.info=Info
bmc_sens3.menu.DebugLevel.info.build.code_debug=3
bmc_sens3.menu.DebugLevel.debug=Debug
bmc_sens3.menu.DebugLevel.debug.build.code_debug=4
bmc_sens3.menu.DebugLevel.verbose=Verbose
bmc_sens3.menu.DebugLevel.verbose.build.code_debug=5

bmc_sens3.menu.EraseFlash.none=Disabled
bmc_sens3.menu.EraseFlash.none.upload.erase_cmd=
bmc_sens3.menu.EraseFlash.all=Enabled
bmc_sens3.menu.EraseFlash.all.upload.erase_cmd=-e

bmc_sens3.menu.ZigbeeMode.default=Disabled
bmc_sens3.menu.ZigbeeMode.default.build.zigbee_mode=
bmc_sens3.menu.ZigbeeMode.default.build.zigbee_libs=
bmc_sens3.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
bmc_sens3.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
bmc_sens3.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr -lzboss_port

##############################################################

esp32doit-devkit-v1.name=DOIT ESP32 DEVKIT V1 (BMC Beta)

esp32doit-devkit-v1.bootloader.tool=esptool_py
esp32doit-devkit-v1.bootloader.tool.default=esptool_py

esp32doit-devkit-v1.upload.tool=esptool_py
esp32doit-devkit-v1.upload.tool.default=esptool_py
esp32doit-devkit-v1.upload.tool.network=esp_ota

esp32doit-devkit-v1.upload.maximum_size=1310720
esp32doit-devkit-v1.upload.maximum_data_size=327680
esp32doit-devkit-v1.upload.flags=
esp32doit-devkit-v1.upload.extra_flags=

esp32doit-devkit-v1.serial.disableDTR=true
esp32doit-devkit-v1.serial.disableRTS=true

esp32doit-devkit-v1.build.tarch=xtensa
esp32doit-devkit-v1.build.bootloader_addr=0x1000
esp32doit-devkit-v1.build.target=esp32
esp32doit-devkit-v1.build.mcu=esp32
esp32doit-devkit-v1.build.core=esp32
esp32doit-devkit-v1.build.variant=doitESP32devkitV1
esp32doit-devkit-v1.build.board=ESP32_DEV

esp32doit-devkit-v1.build.f_cpu=240000000L
esp32doit-devkit-v1.build.flash_mode=dio
esp32doit-devkit-v1.build.flash_size=4MB
esp32doit-devkit-v1.build.boot=dio
esp32doit-devkit-v1.build.partitions=default
esp32doit-devkit-v1.build.defines=
# esp32doit-devkit-v1.build.extra_flags=-DESP32 -include "{build.source.path}/config.h"

esp32doit-devkit-v1.menu.FlashFreq.80=80MHz
esp32doit-devkit-v1.menu.FlashFreq.80.build.flash_freq=80m
esp32doit-devkit-v1.menu.FlashFreq.40=40MHz
esp32doit-devkit-v1.menu.FlashFreq.40.build.flash_freq=40m

esp32doit-devkit-v1.menu.UploadSpeed.921600=921600
esp32doit-devkit-v1.menu.UploadSpeed.921600.upload.speed=921600
esp32doit-devkit-v1.menu.UploadSpeed.115200=115200
esp32doit-devkit-v1.menu.UploadSpeed.115200.upload.speed=115200
esp32doit-devkit-v1.menu.UploadSpeed.256000.windows=256000
esp32doit-devkit-v1.menu.UploadSpeed.256000.upload.speed=256000
esp32doit-devkit-v1.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32doit-devkit-v1.menu.UploadSpeed.230400=230400
esp32doit-devkit-v1.menu.UploadSpeed.230400.upload.speed=230400
esp32doit-devkit-v1.menu.UploadSpeed.460800.linux=460800
esp32doit-devkit-v1.menu.UploadSpeed.460800.macosx=460800
esp32doit-devkit-v1.menu.UploadSpeed.460800.upload.speed=460800
esp32doit-devkit-v1.menu.UploadSpeed.512000.windows=512000
esp32doit-devkit-v1.menu.UploadSpeed.512000.upload.speed=512000

esp32doit-devkit-v1.menu.DebugLevel.none=None
esp32doit-devkit-v1.menu.DebugLevel.none.build.code_debug=0
esp32doit-devkit-v1.menu.DebugLevel.error=Error
esp32doit-devkit-v1.menu.DebugLevel.error.build.code_debug=1
esp32doit-devkit-v1.menu.DebugLevel.warn=Warn
esp32doit-devkit-v1.menu.DebugLevel.warn.build.code_debug=2
esp32doit-devkit-v1.menu.DebugLevel.info=Info
esp32doit-devkit-v1.menu.DebugLevel.info.build.code_debug=3
esp32doit-devkit-v1.menu.DebugLevel.debug=Debug
esp32doit-devkit-v1.menu.DebugLevel.debug.build.code_debug=4

esp32doit-devkit-v1.menu.EraseFlash.none=Disabled
esp32doit-devkit-v1.menu.EraseFlash.none.upload.erase_cmd=
esp32doit-devkit-v1.menu.EraseFlash.all=Enabled
esp32doit-devkit-v1.menu.EraseFlash.all.upload.erase_cmd=-e

