neroroxxx/esp32/boards.txt
##############################################################


esp32micromod.name=SparkFun ESP32 MicroMod (BMC Beta)

esp32micromod.bootloader.tool=esptool_py
esp32micromod.bootloader.tool.default=esptool_py

esp32micromod.upload.tool=esptool_py
esp32micromod.upload.tool.default=esptool_py
esp32micromod.upload.tool.network=esp_ota

esp32micromod.upload.maximum_size=1310720
esp32micromod.upload.maximum_data_size=327680
esp32micromod.upload.wait_for_upload_port=true
esp32micromod.upload.flags=
esp32micromod.upload.extra_flags=

esp32micromod.serial.disableDTR=true
esp32micromod.serial.disableRTS=true

esp32micromod.build.tarch=xtensa
esp32micromod.build.bootloader_addr=0x1000
esp32micromod.build.target=esp32
esp32micromod.build.mcu=esp32
esp32micromod.build.core=esp32
esp32micromod.build.variant=esp32micromod
esp32micromod.build.board=ESP32_MICROMOD

esp32micromod.build.f_cpu=240000000L
esp32micromod.build.flash_size=4MB
esp32micromod.build.flash_freq=40m
esp32micromod.build.flash_mode=dio
esp32micromod.build.boot=dio
esp32micromod.build.partitions=default
esp32micromod.build.defines=
# esp32micromod.build.extra_flags=-DESP32 -include "{build.source.path}/config.h"

esp32micromod.menu.PSRAM.disabled=Disabled
esp32micromod.menu.PSRAM.disabled.build.defines=
esp32micromod.menu.PSRAM.enabled=Enabled
esp32micromod.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

esp32micromod.menu.PartitionScheme.default=BMC APP (3MB No OTA/1MB SPIFFS)
esp32micromod.menu.PartitionScheme.default.build.partitions=huge_app
esp32micromod.menu.PartitionScheme.default.upload.maximum_size=3145728

esp32micromod.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32micromod.menu.CPUFreq.240.build.f_cpu=240000000L
esp32micromod.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32micromod.menu.CPUFreq.160.build.f_cpu=160000000L
esp32micromod.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32micromod.menu.CPUFreq.80.build.f_cpu=80000000L
esp32micromod.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32micromod.menu.CPUFreq.40.build.f_cpu=40000000L
esp32micromod.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32micromod.menu.CPUFreq.26.build.f_cpu=26000000L
esp32micromod.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32micromod.menu.CPUFreq.20.build.f_cpu=20000000L
esp32micromod.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32micromod.menu.CPUFreq.13.build.f_cpu=13000000L
esp32micromod.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32micromod.menu.CPUFreq.10.build.f_cpu=10000000L

esp32micromod.menu.FlashMode.qio=QIO
esp32micromod.menu.FlashMode.qio.build.flash_mode=dio
esp32micromod.menu.FlashMode.qio.build.boot=qio
esp32micromod.menu.FlashMode.dio=DIO
esp32micromod.menu.FlashMode.dio.build.flash_mode=dio
esp32micromod.menu.FlashMode.dio.build.boot=dio

esp32micromod.menu.FlashFreq.80=80MHz
esp32micromod.menu.FlashFreq.80.build.flash_freq=80m
esp32micromod.menu.FlashFreq.40=40MHz
esp32micromod.menu.FlashFreq.40.build.flash_freq=40m

esp32micromod.menu.FlashSize.4M=4MB (32Mb)
esp32micromod.menu.FlashSize.4M.build.flash_size=4MB
esp32micromod.menu.FlashSize.8M=8MB (64Mb)
esp32micromod.menu.FlashSize.8M.build.flash_size=8MB
esp32micromod.menu.FlashSize.2M=2MB (16Mb)
esp32micromod.menu.FlashSize.2M.build.flash_size=2MB
esp32micromod.menu.FlashSize.16M=16MB (128Mb)
esp32micromod.menu.FlashSize.16M.build.flash_size=16MB

esp32micromod.menu.UploadSpeed.921600=921600
esp32micromod.menu.UploadSpeed.921600.upload.speed=921600
esp32micromod.menu.UploadSpeed.115200=115200
esp32micromod.menu.UploadSpeed.115200.upload.speed=115200
esp32micromod.menu.UploadSpeed.256000.windows=256000
esp32micromod.menu.UploadSpeed.256000.upload.speed=256000
esp32micromod.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32micromod.menu.UploadSpeed.230400=230400
esp32micromod.menu.UploadSpeed.230400.upload.speed=230400
esp32micromod.menu.UploadSpeed.460800.linux=460800
esp32micromod.menu.UploadSpeed.460800.macosx=460800
esp32micromod.menu.UploadSpeed.460800.upload.speed=460800
esp32micromod.menu.UploadSpeed.512000.windows=512000
esp32micromod.menu.UploadSpeed.512000.upload.speed=512000

esp32micromod.menu.DebugLevel.none=None
esp32micromod.menu.DebugLevel.none.build.code_debug=0
esp32micromod.menu.DebugLevel.error=Error
esp32micromod.menu.DebugLevel.error.build.code_debug=1
esp32micromod.menu.DebugLevel.warn=Warn
esp32micromod.menu.DebugLevel.warn.build.code_debug=2
esp32micromod.menu.DebugLevel.info=Info
esp32micromod.menu.DebugLevel.info.build.code_debug=3
esp32micromod.menu.DebugLevel.debug=Debug
esp32micromod.menu.DebugLevel.debug.build.code_debug=4
esp32micromod.menu.DebugLevel.verbose=Verbose
esp32micromod.menu.DebugLevel.verbose.build.code_debug=5

esp32micromod.menu.EraseFlash.none=Disabled
esp32micromod.menu.EraseFlash.none.upload.erase_cmd=
esp32micromod.menu.EraseFlash.all=Enabled
esp32micromod.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

lolin_s2_mini.name=LOLIN S2 Mini (BMC Beta)
lolin_s2_mini.vid.0=0x303a
lolin_s2_mini.pid.0=0x80C2

lolin_s2_mini.bootloader.tool=esptool_py
lolin_s2_mini.bootloader.tool.default=esptool_py

lolin_s2_mini.upload.tool=esptool_py
lolin_s2_mini.upload.tool.default=esptool_py
lolin_s2_mini.upload.tool.network=esp_ota
lolin_s2_mini.upload.maximum_size=1310720
lolin_s2_mini.upload.maximum_data_size=327680
lolin_s2_mini.upload.flags=
lolin_s2_mini.upload.extra_flags=
lolin_s2_mini.upload.use_1200bps_touch=true
lolin_s2_mini.upload.wait_for_upload_port=true
lolin_s2_mini.upload.speed=921600

lolin_s2_mini.serial.disableDTR=false
lolin_s2_mini.serial.disableRTS=false

lolin_s2_mini.build.tarch=xtensa
lolin_s2_mini.build.bootloader_addr=0x1000
lolin_s2_mini.build.target=esp32s2
lolin_s2_mini.build.mcu=esp32s2
lolin_s2_mini.build.core=esp32
lolin_s2_mini.build.variant=lolin_s2_mini
lolin_s2_mini.build.board=LOLIN_S2_MINI
lolin_s2_mini.build.cdc_on_boot=1
lolin_s2_mini.build.msc_on_boot=0
lolin_s2_mini.build.dfu_on_boot=0
lolin_s2_mini.build.f_cpu=240000000L
lolin_s2_mini.build.flash_size=4MB
lolin_s2_mini.build.flash_freq=80m
lolin_s2_mini.build.flash_mode=dio
lolin_s2_mini.build.boot=qio
lolin_s2_mini.build.partitions=default
lolin_s2_mini.build.defines=
# lolin_s2_mini.build.extra_flags=-DESP32 -include "{build.source.path}/config.h"
lolin_s2_mini.build.defines=-DBOARD_HAS_PSRAM

lolin_s2_mini.menu.CDCOnBoot.default=Enabled
lolin_s2_mini.menu.CDCOnBoot.default.build.cdc_on_boot=1
# lolin_s2_mini.menu.CDCOnBoot.dis_cdc=Disabled
# lolin_s2_mini.menu.CDCOnBoot.dis_cdc.build.cdc_on_boot=0

lolin_s2_mini.menu.MSCOnBoot.default=Disabled
lolin_s2_mini.menu.MSCOnBoot.default.build.msc_on_boot=0
# lolin_s2_mini.menu.MSCOnBoot.msc=Enabled
# lolin_s2_mini.menu.MSCOnBoot.msc.build.msc_on_boot=1

lolin_s2_mini.menu.DFUOnBoot.default=Disabled
lolin_s2_mini.menu.DFUOnBoot.default.build.dfu_on_boot=0
# lolin_s2_mini.menu.DFUOnBoot.dfu=Enabled
# lolin_s2_mini.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

