neroroxxx/esp32/boards.txt
lolin_s2_mini.menu.PartitionScheme.default=BMC APP (3MB No OTA/1MB SPIFFS)
lolin_s2_mini.menu.PartitionScheme.default.build.partitions=huge_app
lolin_s2_mini.menu.PartitionScheme.default.upload.maximum_size=3145728


lolin_s2_mini.menu.DebugLevel.none=None
lolin_s2_mini.menu.DebugLevel.none.build.code_debug=0
lolin_s2_mini.menu.DebugLevel.error=Error
lolin_s2_mini.menu.DebugLevel.error.build.code_debug=1
lolin_s2_mini.menu.DebugLevel.warn=Warn
lolin_s2_mini.menu.DebugLevel.warn.build.code_debug=2
lolin_s2_mini.menu.DebugLevel.info=Info
lolin_s2_mini.menu.DebugLevel.info.build.code_debug=3
lolin_s2_mini.menu.DebugLevel.debug=Debug
lolin_s2_mini.menu.DebugLevel.debug.build.code_debug=4
lolin_s2_mini.menu.DebugLevel.verbose=Verbose
lolin_s2_mini.menu.DebugLevel.verbose.build.code_debug=5

lolin_s2_mini.menu.EraseFlash.none=Disabled
lolin_s2_mini.menu.EraseFlash.none.upload.erase_cmd=
lolin_s2_mini.menu.EraseFlash.all=Enabled
lolin_s2_mini.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

waveshare_esp32_s3_zero.name=Waveshare ESP32-S3-Zero (BMC Beta)
waveshare_esp32_s3_zero.vid.0=0x303a
waveshare_esp32_s3_zero.pid.0=0x822B
waveshare_esp32_s3_zero.upload_port.0.vid=0x303a
waveshare_esp32_s3_zero.upload_port.0.pid=0x822B

waveshare_esp32_s3_zero.bootloader.tool=esptool_py
waveshare_esp32_s3_zero.bootloader.tool.default=esptool_py

waveshare_esp32_s3_zero.upload.tool=esptool_py
waveshare_esp32_s3_zero.upload.tool.default=esptool_py
waveshare_esp32_s3_zero.upload.tool.network=esp_ota

waveshare_esp32_s3_zero.upload.maximum_size=1310720

waveshare_esp32_s3_zero.upload.maximum_data_size=327680
waveshare_esp32_s3_zero.upload.flags=
waveshare_esp32_s3_zero.upload.extra_flags=
waveshare_esp32_s3_zero.upload.use_1200bps_touch=true
waveshare_esp32_s3_zero.upload.wait_for_upload_port=true

waveshare_esp32_s3_zero.serial.disableDTR=false
waveshare_esp32_s3_zero.serial.disableRTS=false

waveshare_esp32_s3_zero.build.tarch=xtensa
waveshare_esp32_s3_zero.build.bootloader_addr=0x0
waveshare_esp32_s3_zero.build.target=esp32s3
waveshare_esp32_s3_zero.build.mcu=esp32s3
waveshare_esp32_s3_zero.build.core=esp32
waveshare_esp32_s3_zero.build.variant=waveshare_esp32_s3_zero
waveshare_esp32_s3_zero.build.board=WAVESHARE_ESP32_S3_ZERO

waveshare_esp32_s3_zero.build.usb_mode=1
waveshare_esp32_s3_zero.build.cdc_on_boot=0
waveshare_esp32_s3_zero.build.msc_on_boot=0
waveshare_esp32_s3_zero.build.dfu_on_boot=0
waveshare_esp32_s3_zero.build.f_cpu=240000000L
waveshare_esp32_s3_zero.build.flash_size=4MB
waveshare_esp32_s3_zero.build.flash_freq=80m
waveshare_esp32_s3_zero.build.flash_mode=dio
waveshare_esp32_s3_zero.build.boot=qio
waveshare_esp32_s3_zero.build.boot_freq=80m
waveshare_esp32_s3_zero.build.partitions=default
waveshare_esp32_s3_zero.build.defines=
# waveshare_esp32_s3_zero.build.extra_flags=-DESP32 -include "{build.source.path}/config.h"
waveshare_esp32_s3_zero.build.loop_core=
waveshare_esp32_s3_zero.build.event_core=
waveshare_esp32_s3_zero.build.psram_type=qspi
waveshare_esp32_s3_zero.build.memory_type={build.boot}_{build.psram_type}

waveshare_esp32_s3_zero.menu.PSRAM.disabled=Disabled
waveshare_esp32_s3_zero.menu.PSRAM.disabled.build.defines=
waveshare_esp32_s3_zero.menu.PSRAM.disabled.build.psram_type=qspi
waveshare_esp32_s3_zero.menu.PSRAM.enabled=Enabled
waveshare_esp32_s3_zero.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
waveshare_esp32_s3_zero.menu.PSRAM.enabled.build.psram_type=qspi

waveshare_esp32_s3_zero.menu.FlashMode.qio=QIO 80MHz
waveshare_esp32_s3_zero.menu.FlashMode.qio.build.flash_mode=dio
waveshare_esp32_s3_zero.menu.FlashMode.qio.build.boot=qio
waveshare_esp32_s3_zero.menu.FlashMode.qio.build.boot_freq=80m
waveshare_esp32_s3_zero.menu.FlashMode.qio.build.flash_freq=80m
waveshare_esp32_s3_zero.menu.FlashMode.qio120=QIO 120MHz
waveshare_esp32_s3_zero.menu.FlashMode.qio120.build.flash_mode=dio
waveshare_esp32_s3_zero.menu.FlashMode.qio120.build.boot=qio
waveshare_esp32_s3_zero.menu.FlashMode.qio120.build.boot_freq=120m
waveshare_esp32_s3_zero.menu.FlashMode.qio120.build.flash_freq=80m

waveshare_esp32_s3_zero.menu.LoopCore.1=Core 1
waveshare_esp32_s3_zero.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
waveshare_esp32_s3_zero.menu.LoopCore.0=Core 0
waveshare_esp32_s3_zero.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

waveshare_esp32_s3_zero.menu.EventsCore.1=Core 1
waveshare_esp32_s3_zero.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
waveshare_esp32_s3_zero.menu.EventsCore.0=Core 0
waveshare_esp32_s3_zero.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

# waveshare_esp32_s3_zero.menu.USBMode.hwcdc=Hardware CDC and JTAG
# waveshare_esp32_s3_zero.menu.USBMode.hwcdc.build.usb_mode=1
waveshare_esp32_s3_zero.menu.USBMode.default=USB-OTG (TinyUSB)
waveshare_esp32_s3_zero.menu.USBMode.default.build.usb_mode=0

# waveshare_esp32_s3_zero.menu.CDCOnBoot.default=Disabled
# waveshare_esp32_s3_zero.menu.CDCOnBoot.default.build.cdc_on_boot=0
waveshare_esp32_s3_zero.menu.CDCOnBoot.cdc=Enabled
waveshare_esp32_s3_zero.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

waveshare_esp32_s3_zero.menu.MSCOnBoot.default=Disabled
waveshare_esp32_s3_zero.menu.MSCOnBoot.default.build.msc_on_boot=0
# waveshare_esp32_s3_zero.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
# waveshare_esp32_s3_zero.menu.MSCOnBoot.msc.build.msc_on_boot=1

waveshare_esp32_s3_zero.menu.DFUOnBoot.default=Disabled
waveshare_esp32_s3_zero.menu.DFUOnBoot.default.build.dfu_on_boot=0
# waveshare_esp32_s3_zero.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
# waveshare_esp32_s3_zero.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

# waveshare_esp32_s3_zero.menu.UploadMode.default=UART0 / Hardware CDC
# waveshare_esp32_s3_zero.menu.UploadMode.default.upload.use_1200bps_touch=false
# waveshare_esp32_s3_zero.menu.UploadMode.default.upload.wait_for_upload_port=false
waveshare_esp32_s3_zero.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
waveshare_esp32_s3_zero.menu.UploadMode.cdc.upload.use_1200bps_touch=true
waveshare_esp32_s3_zero.menu.UploadMode.cdc.upload.wait_for_upload_port=true

waveshare_esp32_s3_zero.menu.PartitionScheme.default=BMC APP (3MB No OTA/1MB SPIFFS)
waveshare_esp32_s3_zero.menu.PartitionScheme.default.build.partitions=huge_app
waveshare_esp32_s3_zero.menu.PartitionScheme.default.upload.maximum_size=3145728

