neroroxxx/esp32/boards.txt
waveshare_esp32_s3_zero.menu.CPUFreq.240=240MHz (WiFi)
waveshare_esp32_s3_zero.menu.CPUFreq.240.build.f_cpu=240000000L
waveshare_esp32_s3_zero.menu.CPUFreq.160=160MHz (WiFi)
waveshare_esp32_s3_zero.menu.CPUFreq.160.build.f_cpu=160000000L
waveshare_esp32_s3_zero.menu.CPUFreq.80=80MHz (WiFi)
waveshare_esp32_s3_zero.menu.CPUFreq.80.build.f_cpu=80000000L
waveshare_esp32_s3_zero.menu.CPUFreq.40=40MHz
waveshare_esp32_s3_zero.menu.CPUFreq.40.build.f_cpu=40000000L
waveshare_esp32_s3_zero.menu.CPUFreq.20=20MHz
waveshare_esp32_s3_zero.menu.CPUFreq.20.build.f_cpu=20000000L
waveshare_esp32_s3_zero.menu.CPUFreq.10=10MHz
waveshare_esp32_s3_zero.menu.CPUFreq.10.build.f_cpu=10000000L

waveshare_esp32_s3_zero.menu.UploadSpeed.921600=921600
waveshare_esp32_s3_zero.menu.UploadSpeed.921600.upload.speed=921600
waveshare_esp32_s3_zero.menu.UploadSpeed.115200=115200
waveshare_esp32_s3_zero.menu.UploadSpeed.115200.upload.speed=115200
waveshare_esp32_s3_zero.menu.UploadSpeed.256000.windows=256000
waveshare_esp32_s3_zero.menu.UploadSpeed.256000.upload.speed=256000
waveshare_esp32_s3_zero.menu.UploadSpeed.230400.windows.upload.speed=256000
waveshare_esp32_s3_zero.menu.UploadSpeed.230400=230400
waveshare_esp32_s3_zero.menu.UploadSpeed.230400.upload.speed=230400
waveshare_esp32_s3_zero.menu.UploadSpeed.460800.linux=460800
waveshare_esp32_s3_zero.menu.UploadSpeed.460800.macosx=460800
waveshare_esp32_s3_zero.menu.UploadSpeed.460800.upload.speed=460800
waveshare_esp32_s3_zero.menu.UploadSpeed.512000.windows=512000
waveshare_esp32_s3_zero.menu.UploadSpeed.512000.upload.speed=512000

waveshare_esp32_s3_zero.menu.DebugLevel.none=None
waveshare_esp32_s3_zero.menu.DebugLevel.none.build.code_debug=0
waveshare_esp32_s3_zero.menu.DebugLevel.error=Error
waveshare_esp32_s3_zero.menu.DebugLevel.error.build.code_debug=1
waveshare_esp32_s3_zero.menu.DebugLevel.warn=Warn
waveshare_esp32_s3_zero.menu.DebugLevel.warn.build.code_debug=2
waveshare_esp32_s3_zero.menu.DebugLevel.info=Info
waveshare_esp32_s3_zero.menu.DebugLevel.info.build.code_debug=3
waveshare_esp32_s3_zero.menu.DebugLevel.debug=Debug
waveshare_esp32_s3_zero.menu.DebugLevel.debug.build.code_debug=4
waveshare_esp32_s3_zero.menu.DebugLevel.verbose=Verbose
waveshare_esp32_s3_zero.menu.DebugLevel.verbose.build.code_debug=5

waveshare_esp32_s3_zero.menu.EraseFlash.none=Disabled
waveshare_esp32_s3_zero.menu.EraseFlash.none.upload.erase_cmd=
waveshare_esp32_s3_zero.menu.EraseFlash.all=Enabled
waveshare_esp32_s3_zero.menu.EraseFlash.all.upload.erase_cmd=-e

######################################################